app/Http/Controllers/CartController.php

select * from `categories` where `categories`.`id` = '74' limit 1
select * from `restorants` where `restorants`.`id` = '21' limit 1
---
    public function add(Request $request)
    {
        $item = Items::find($request->id);
        $restID = $item->category->restorant->id;

        $restaurant = Restorant::findOrFail($restID);

select * from `tables` where `restaurant_id` = 16
---
                $addresses = $this->getAccessibleAddresses($restaurant, auth()->user()->addresses->reverse());
            }

            $tables = Tables::where('restaurant_id', $restaurant->id)->get();