app/Http/Controllers/Controller.php

select * from `coupons`
---
    public function getRestaurant()
    {
        if (auth()->user()->hasRole('admin'))
        {
            return Coupons::all();