app/Http/Controllers/CustomOrderController.php

select * from `users` where (`id` = '4') limit 1
---
    public function getById(Request $request){

        $userId = $request->get('id');
        $result = User::where(['id'=>$userId])->first();

select * from `items` where (`id` = '1') and `items`.`deleted_at` is null limit 1
---
    public function getItem($id){
        $result = Items::where(['id'=>$id])->first();

select `items`.*, `items`.`name`, `items`.`price` from `restorants` inner join `categories` on `categories`.`restorant_id` = `restorants`.`id` inner join `items` on `items`.`category_id` = `categories`.`id` where `restorants`.`id` = '1'
---
    function getProduct(Request $request){

        $productId = $request->get('id');

        $product = DB::table('restorants')
            ->join('categories', 'categories.restorant_id', '=', 'restorants.id')
            ->join('items', 'items.category_id', '=', 'categories.id')
            ->select('items.*','items.name','items.price')
            ->where('restorants.id','=', $productId)
            ->get();