app/Http/Controllers/FrontEndController.php

select * from `categories` where `categories`.`id` in (9, 17, 26, 34, 46, 49, 61, 65)
select * from `items` where (`available` = 1) and (`name` like '%Sprite (330ml)%' or `description` like '%Sprite (330ml)%') and `items`.`deleted_at` is null
select * from `restorants` where `restorants`.`id` in (2, 4, 7, 8, 11, 12, 15, 16)
---
    private function filterRestaurantsOnQuery($restaurantIDS)
    {
        //1. Find all items
        $items = Items::where(['available' => 1])->where(function ($q) {
            $stripedQuery = '%'.strip_tags(\Request::input('q')).'%';
            $q->where('name', 'like', $stripedQuery)->orWhere('description', 'like', $stripedQuery);
        })->with('category.restorant')->get();

select * from `pages` where `showAsLink` = 1
---
                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink', 1)->get(),

select * from `pages` where `showAsLink` = 1
---
            $testimonials = Testimonials::where('post_type', 'testimonial')->get();
            $processes = Process::where('post_type', 'process')->get();

            $response = new \Illuminate\Http\Response(view('social.home', [
                'col' => $colCounter[count($plans)-1],
                'plans' => $plans,
                'availableLanguages' => $availableLanguages,
                'locale' => $locale,
                'pages' => Pages::where('showAsLink', 1)->get(),
                'features' => $features,
                'testimonials' => $testimonials,
                'processes' => $processes
            ]));

select * from `restorants` where `active` = 1
select * from `banners`
---
        } else {
            //CASE 1 - nothing at all
            //No query at all
            array_push($sections, ['title'=>__('Popular restaurants'), 'restorants' =>Restorant::where('active', 1)->get()->shuffle()]);
        }

        $banners_data = Banners::all();

select * from `restorants` where `subdomain` = 'chowkgrocery' limit 1
update `restorants` set `views` = `views` + 1, `restorants`.`updated_at` = '2021-03-14 21:24:21' where `id` = '21'
---
    public function restorant($alias)
    {
        $subDomain = $this->getSubDomain();
        if ($subDomain && $alias !== $subDomain) {
            return redirect()->route('restorant', $subDomain);
        }
        $restorant = Restorant::whereRaw('REPLACE(subdomain, "-", "") = ?', [str_replace("-","",$alias)])->first();

        if ($restorant->active == 1) {

            if(isset($_GET['pay'])){
                //This is a payment link
                $order=Order::findOrFail($_GET['pay']);
                if($order->restorant_id==$restorant->id){
                    return redirect($order->payment_link);
                }
            }

            $restorant->increment('views');

select * from `users` where `id` = '34'
---
            $usernames = [];
            if ($restorant && $restorant->ratings) {
                foreach ($restorant->ratings as $rating) {
                    $user = User::where('id', $rating->user_id)->get()->first();

select * from `tables` where `restaurant_id` = 21
---
            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();