app/Http/Controllers/RestorantController.php

    public function storeRegisterRestaurant(Request $request)
    {
        //Validate first
        $theRules = [
            'name' => ['required', 'string', 'unique:restorants,name', 'max:255'],
            'name_owner' => ['required', 'string', 'max:255'],
            'email_owner' => ['required', 'string', 'email', 'unique:users,email', 'max:255'],
            'phone_owner' => ['required', 'string', 'regex:/^([0-9\s\-\+\(\)]*)$/'],
        ];

        if (strlen(config('settings.recaptcha_site_key')) > 2) {
            $theRules['g-recaptcha-response'] = 'recaptcha';
        }

        $request->validate($theRules);

        //Create the user
        //$generatedPassword = Str::random(10);
        $owner = new User;
        $owner->name = strip_tags($request->name_owner);
        $owner->email = strip_tags($request->email_owner);
        $owner->phone = strip_tags($request->phone_owner) | '';
        $owner->active = 0;
        $owner->api_token = Str::random(80);

        $owner->password = null;
        $owner->save();
---
insert into `users` (`name`, `email`, `phone`, `active`, `api_token`, `password`, `updated_at`, `created_at`) values ('Chikagos', 'dimovdaniel2@yahoo.com', '078203673', 0, 'naTsQJPbrJ76vYDaLJnWhgedUxob8NmzoXYo96VM877OIM8ki6Mu2sskyDO4imPcDOd8YeMhhemux9ez', '', '2021-02-08 17:53:12', '2021-02-08 17:53:12')

    private function makeRestaurantActive(Restorant $restaurant)
    {
        //Activate the restaurant
        $restaurant->active = 1;
        $restaurant->subdomain = $this->makeAlias($restaurant->name);
        $restaurant->update();

        $owner = $restaurant->user;

        //if the restaurant is first time activated
        if ($owner->password == null) {
            //Activate the owner
            $generatedPassword = Str::random(10);

            $owner->password = Hash::make($generatedPassword);
            $owner->active = 1;
            $owner->update();
---
update `users` set `password` = 'y$AtiClikZ/bhl064k2K5eb.93eMoUuoqzMZ327nId6WGYfWd.mm/bS', `active` = 1, `users`.`updated_at` = '2021-02-08 17:53:12' where `id` = 6